Revit 2024 API
StairsEndConnectionType Enumeration
 The join style between a run and landing.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum StairsEndConnectionType
Visual Basic
Public Enumeration StairsEndConnectionType
Visual C++
public enum class StairsEndConnectionType
Members
Member name | Description
StraightCut |  The run and landing are joined by a straight cut.
Notch |  The run and landing are joined by a notch.
See Also
Autodesk.Revit.DB.Architecture Namespace